<a href="https://colab.research.google.com/github/Kasurirohith/B23_10I2/blob/main/29_08_25_lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import pandas as pd

In [10]:
data = [10, 20, 30, 40, 50]
series = pd.Series(data)
print("Pandas Series:")
print(series)

Pandas Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
data = [10, 20, 30, 40, 50]
index_labels = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index_labels)
print("Series with Custom Index:")
print(series)

Series with Custom Index:
a    10
b    20
c    30
d    40
e    50
dtype: int64

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['Hyderabad', 'Hanamkonda', 'Warangal', 'Chennai']
}
df = pd.DataFrame(data)
print("DataFrame:")
print(df)

DataFrame:
      Name  Age        City
0    Alice   25   Hyderabad
1      Bob   30  Hanamkonda
2  Charlie   35    Warangal
3    David   40     Chennai

In [12]:
data = {
    'Name': ['Rohith','Sam','John','David'],
    'Age': [25,30,35,40],
    'City': ['Hyderabad','Delhi','Mumbai','Chennai']
}
df = pd.DataFrame(data)
print(df)

     Name  Age       City
0  Rohith   25  Hyderabad
1     Sam   30      Delhi
2    John   35     Mumbai
3   David   40    Chennai

In [13]:

print(df['Name'])

0    Rohith
1       Sam
2      John
3     David
Name: Name, dtype: object

In [14]:

print(df['Name'])

0    Rohith
1       Sam
2      John
3     David
Name: Name, dtype: object

In [15]:

print(df[['Name','City']])

     Name       City
0  Rohith  Hyderabad
1     Sam      Delhi
2    John     Mumbai
3   David    Chennai

In [16]:

print(df.iloc[1])

print(df.loc[2])

Name      Sam
Age        30
City    Delhi
Name: 1, dtype: object
Name      John
Age         35
City    Mumbai
Name: 2, dtype: object

In [17]:

df['Salary'] = [40000,50000,60000,70000]
print(df)

     Name  Age       City  Salary
0  Rohith   25  Hyderabad   40000
1     Sam   30      Delhi   50000
2    John   35     Mumbai   60000
3   David   40    Chennai   70000

In [18]:

df = df.drop('City',axis=1)
print(df)

     Name  Age  Salary
0  Rohith   25   40000
1     Sam   30   50000
2    John   35   60000
3   David   40   70000

In [19]:

print(df[df['Age']>30])

    Name  Age  Salary
2   John   35   60000
3  David   40   70000

In [20]:
print("Average Age:", df['Age'].mean())
print("Maximum Age:", df['Age'].max())
print("Minimum Age:", df['Age'].min())

Average Age: 32.5
Maximum Age: 40
Minimum Age: 25

In [24]:
import pandas as pd

student_data = {
    'Student_id': [4034,4033,1630,1036],
    'Name' : ['Rohith','Sam','John','David'],
    'Marks': [85,90,78,92],
    'Department':['ECE','CSE','ECE','CSE']
}
df = pd.DataFrame(student_data)

print("Student Data:")
print(df)

Student Data:
   Student_id    Name  Marks Department
0        4034  Rohith     85        ECE
1        4033     Sam     90        CSE
2        1630    John     78        ECE
3        1036   David     92        CSE

In [25]:
print("Student Names:")
print(df['Name'])

Student Names:
0    Rohith
1       Sam
2      John
3     David
Name: Name, dtype: object

In [26]:
print("Names and Marks:")
print(df[['Name','Marks']])

Names and Marks:
     Name  Marks
0  Rohith     85
1     Sam     90
2    John     78
3   David     92

In [27]:

print("2nd row using iloc:")
print(df.iloc[1])

print("Row with index 2 using loc:")
print(df.loc[2])

2nd row using iloc:
Student_id    4033
Name           Sam
Marks           90
Department     CSE
Name: 1, dtype: object
Row with index 2 using loc:
Student_id    1630
Name          John
Marks           78
Department     ECE
Name: 2, dtype: object

In [28]:

print("2nd row using iloc:")
print(df.iloc[1])

print("Row with index 2 using loc:")
print(df.loc[2])

2nd row using iloc:
Student_id    4033
Name           Sam
Marks           90
Department     CSE
Name: 1, dtype: object
Row with index 2 using loc:
Student_id    1630
Name          John
Marks           78
Department     ECE
Name: 2, dtype: object

In [29]:

df['Grade'] = ['A','A+','B','A+']
print("Student Data with Grades:")
print(df)

Student Data with Grades:
   Student_id    Name  Marks Department Grade
0        4034  Rohith     85        ECE     A
1        4033     Sam     90        CSE    A+
2        1630    John     78        ECE     B
3        1036   David     92        CSE    A+

In [30]:
df = df.drop('Department', axis=1)
print("After Removing Department Column:")
print(df)

After Removing Department Column:
   Student_id    Name  Marks Grade
0        4034  Rohith     85     A
1        4033     Sam     90    A+
2        1630    John     78     B
3        1036   David     92    A+

In [31]:
print("Students with Marks > 85:")
print(df[df['Marks'] > 85])

Students with Marks > 85:
   Student_id   Name  Marks Grade
1        4033    Sam     90    A+
3        1036  David     92    A+

In [32]:
print("Average Marks:", df['Marks'].mean())
print("Maximum Marks:", df['Marks'].max())
print("Minimum Marks:", df['Marks'].min())

Average Marks: 86.25
Maximum Marks: 92
Minimum Marks: 78